HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxEvadc_bf.h
/** \brief Offset for Ifx_EVADC_G_REVNP0_Bits.REV2NP */
#define IFX_EVADC_G_REVNP0_REV2NP_OFF (8u)

/** \brief Length for Ifx_EVADC_G_REVNP0_Bits.REV3NP */
#define IFX_EVADC_G_REVNP0_REV3NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP0_Bits.REV3NP */
#define IFX_EVADC_G_REVNP0_REV3NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP0_Bits.REV3NP */
#define IFX_EVADC_G_REVNP0_REV3NP_OFF (12u)

/** \brief Length for Ifx_EVADC_G_REVNP0_Bits.REV4NP */
#define IFX_EVADC_G_REVNP0_REV4NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP0_Bits.REV4NP */
#define IFX_EVADC_G_REVNP0_REV4NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP0_Bits.REV4NP */
#define IFX_EVADC_G_REVNP0_REV4NP_OFF (16u)

/** \brief Length for Ifx_EVADC_G_REVNP0_Bits.REV5NP */
#define IFX_EVADC_G_REVNP0_REV5NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP0_Bits.REV5NP */
#define IFX_EVADC_G_REVNP0_REV5NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP0_Bits.REV5NP */
#define IFX_EVADC_G_REVNP0_REV5NP_OFF (20u)

/** \brief Length for Ifx_EVADC_G_REVNP0_Bits.REV6NP */
#define IFX_EVADC_G_REVNP0_REV6NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP0_Bits.REV6NP */
#define IFX_EVADC_G_REVNP0_REV6NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP0_Bits.REV6NP */
#define IFX_EVADC_G_REVNP0_REV6NP_OFF (24u)

/** \brief Length for Ifx_EVADC_G_REVNP0_Bits.REV7NP */
#define IFX_EVADC_G_REVNP0_REV7NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP0_Bits.REV7NP */
#define IFX_EVADC_G_REVNP0_REV7NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP0_Bits.REV7NP */
#define IFX_EVADC_G_REVNP0_REV7NP_OFF (28u)

/** \brief Length for Ifx_EVADC_G_REVNP1_Bits.REV8NP */
#define IFX_EVADC_G_REVNP1_REV8NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP1_Bits.REV8NP */
#define IFX_EVADC_G_REVNP1_REV8NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP1_Bits.REV8NP */
#define IFX_EVADC_G_REVNP1_REV8NP_OFF (0u)

/** \brief Length for Ifx_EVADC_G_REVNP1_Bits.REV9NP */
#define IFX_EVADC_G_REVNP1_REV9NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP1_Bits.REV9NP */
#define IFX_EVADC_G_REVNP1_REV9NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP1_Bits.REV9NP */
#define IFX_EVADC_G_REVNP1_REV9NP_OFF (4u)

/** \brief Length for Ifx_EVADC_G_REVNP1_Bits.REV10NP */
#define IFX_EVADC_G_REVNP1_REV10NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP1_Bits.REV10NP */
#define IFX_EVADC_G_REVNP1_REV10NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP1_Bits.REV10NP */
#define IFX_EVADC_G_REVNP1_REV10NP_OFF (8u)

/** \brief Length for Ifx_EVADC_G_REVNP1_Bits.REV11NP */
#define IFX_EVADC_G_REVNP1_REV11NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP1_Bits.REV11NP */
#define IFX_EVADC_G_REVNP1_REV11NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP1_Bits.REV11NP */
#define IFX_EVADC_G_REVNP1_REV11NP_OFF (12u)

/** \brief Length for Ifx_EVADC_G_REVNP1_Bits.REV12NP */
#define IFX_EVADC_G_REVNP1_REV12NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP1_Bits.REV12NP */
#define IFX_EVADC_G_REVNP1_REV12NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP1_Bits.REV12NP */
#define IFX_EVADC_G_REVNP1_REV12NP_OFF (16u)

/** \brief Length for Ifx_EVADC_G_REVNP1_Bits.REV13NP */
#define IFX_EVADC_G_REVNP1_REV13NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP1_Bits.REV13NP */
#define IFX_EVADC_G_REVNP1_REV13NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP1_Bits.REV13NP */
#define IFX_EVADC_G_REVNP1_REV13NP_OFF (20u)

/** \brief Length for Ifx_EVADC_G_REVNP1_Bits.REV14NP */
#define IFX_EVADC_G_REVNP1_REV14NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP1_Bits.REV14NP */
#define IFX_EVADC_G_REVNP1_REV14NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP1_Bits.REV14NP */
#define IFX_EVADC_G_REVNP1_REV14NP_OFF (24u)

/** \brief Length for Ifx_EVADC_G_REVNP1_Bits.REV15NP */
#define IFX_EVADC_G_REVNP1_REV15NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP1_Bits.REV15NP */
#define IFX_EVADC_G_REVNP1_REV15NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP1_Bits.REV15NP */
#define IFX_EVADC_G_REVNP1_REV15NP_OFF (28u)

/** \brief Length for Ifx_EVADC_G_SEVNP_Bits.SEV0NP */
#define IFX_EVADC_G_SEVNP_SEV0NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_SEVNP_Bits.SEV0NP */
#define IFX_EVADC_G_SEVNP_SEV0NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_SEVNP_Bits.SEV0NP */
#define IFX_EVADC_G_SEVNP_SEV0NP_OFF (0u)

/** \brief Length for Ifx_EVADC_G_SEVNP_Bits.SEV1NP */
#define IFX_EVADC_G_SEVNP_SEV1NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_SEVNP_Bits.SEV1NP */
#define IFX_EVADC_G_SEVNP_SEV1NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_SEVNP_Bits.SEV1NP */
#define IFX_EVADC_G_SEVNP_SEV1NP_OFF (4u)

/** \brief Length for Ifx_EVADC_G_SEVNP_Bits.SEV2NP */
#define IFX_EVADC_G_SEVNP_SEV2NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_SEVNP_Bits.SEV2NP */
#define IFX_EVADC_G_SEVNP_SEV2NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_SEVNP_Bits.SEV2NP */
#define IFX_EVADC_G_SEVNP_SEV2NP_OFF (8u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.AGSR0 */
#define IFX_EVADC_G_SRACT_AGSR0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.AGSR0 */
#define IFX_EVADC_G_SRACT_AGSR0_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.AGSR0 */
#define IFX_EVADC_G_SRACT_AGSR0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.AGSR1 */
#define IFX_EVADC_G_SRACT_AGSR1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.AGSR1 */
#define IFX_EVADC_G_SRACT_AGSR1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.AGSR1 */
#define IFX_EVADC_G_SRACT_AGSR1_OFF (1u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.AGSR2 */
#define IFX_EVADC_G_SRACT_AGSR2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.AGSR2 */
#define IFX_EVADC_G_SRACT_AGSR2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.AGSR2 */
#define IFX_EVADC_G_SRACT_AGSR2_OFF (2u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.AGSR3 */
#define IFX_EVADC_G_SRACT_AGSR3_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.AGSR3 */
#define IFX_EVADC_G_SRACT_AGSR3_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.AGSR3 */
#define IFX_EVADC_G_SRACT_AGSR3_OFF (3u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.ASSR0 */
#define IFX_EVADC_G_SRACT_ASSR0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.ASSR0 */
#define IFX_EVADC_G_SRACT_ASSR0_MSK (0x1u)

