HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxEvadc_bf.h
/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.ASSR0 */
#define IFX_EVADC_G_SRACT_ASSR0_OFF (8u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.ASSR1 */
#define IFX_EVADC_G_SRACT_ASSR1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.ASSR1 */
#define IFX_EVADC_G_SRACT_ASSR1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.ASSR1 */
#define IFX_EVADC_G_SRACT_ASSR1_OFF (9u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.ASSR2 */
#define IFX_EVADC_G_SRACT_ASSR2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.ASSR2 */
#define IFX_EVADC_G_SRACT_ASSR2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.ASSR2 */
#define IFX_EVADC_G_SRACT_ASSR2_OFF (10u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.ASSR3 */
#define IFX_EVADC_G_SRACT_ASSR3_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.ASSR3 */
#define IFX_EVADC_G_SRACT_ASSR3_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.ASSR3 */
#define IFX_EVADC_G_SRACT_ASSR3_OFF (11u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_EVADC_G_EMUXCTR_EMUXSET_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_EVADC_G_EMUXCTR_EMUXSET_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_EVADC_G_EMUXCTR_EMUXSET_OFF (0u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_EVADC_G_EMUXCTR_EMUXMODE_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_EVADC_G_EMUXCTR_EMUXMODE_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_EVADC_G_EMUXCTR_EMUXMODE_OFF (4u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_EVADC_G_EMUXCTR_EMXCOD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_EVADC_G_EMUXCTR_EMXCOD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_EVADC_G_EMUXCTR_EMXCOD_OFF (12u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMXST */
#define IFX_EVADC_G_EMUXCTR_EMXST_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMXST */
#define IFX_EVADC_G_EMUXCTR_EMXST_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMXST */
#define IFX_EVADC_G_EMUXCTR_EMXST_OFF (13u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_EVADC_G_EMUXCTR_EMXCSS_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_EVADC_G_EMUXCTR_EMXCSS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_EVADC_G_EMUXCTR_EMXCSS_OFF (14u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_EVADC_G_EMUXCTR_EMXWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_EVADC_G_EMUXCTR_EMXWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_EVADC_G_EMUXCTR_EMXWC_OFF (15u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_EVADC_G_EMUXCTR_EMUXACT_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_EVADC_G_EMUXCTR_EMUXACT_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_EVADC_G_EMUXCTR_EMUXACT_OFF (16u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMUXCCB */
#define IFX_EVADC_G_EMUXCTR_EMUXCCB_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMUXCCB */
#define IFX_EVADC_G_EMUXCTR_EMUXCCB_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMUXCCB */
#define IFX_EVADC_G_EMUXCTR_EMUXCCB_OFF (20u)

/** \brief Length for Ifx_EVADC_G_EMUXCS_Bits.EMUXCH */
#define IFX_EVADC_G_EMUXCS_EMUXCH_LEN (16u)

/** \brief Mask for Ifx_EVADC_G_EMUXCS_Bits.EMUXCH */
#define IFX_EVADC_G_EMUXCS_EMUXCH_MSK (0xffffu)

/** \brief Offset for Ifx_EVADC_G_EMUXCS_Bits.EMUXCH */
#define IFX_EVADC_G_EMUXCS_EMUXCH_OFF (0u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF0 */
#define IFX_EVADC_G_VFR_VF0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF0 */
#define IFX_EVADC_G_VFR_VF0_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF0 */
#define IFX_EVADC_G_VFR_VF0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF1 */
#define IFX_EVADC_G_VFR_VF1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF1 */
#define IFX_EVADC_G_VFR_VF1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF1 */
#define IFX_EVADC_G_VFR_VF1_OFF (1u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF2 */
#define IFX_EVADC_G_VFR_VF2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF2 */
#define IFX_EVADC_G_VFR_VF2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF2 */
#define IFX_EVADC_G_VFR_VF2_OFF (2u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF3 */
#define IFX_EVADC_G_VFR_VF3_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF3 */
#define IFX_EVADC_G_VFR_VF3_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF3 */
#define IFX_EVADC_G_VFR_VF3_OFF (3u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF4 */
#define IFX_EVADC_G_VFR_VF4_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF4 */
#define IFX_EVADC_G_VFR_VF4_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF4 */
#define IFX_EVADC_G_VFR_VF4_OFF (4u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF5 */
#define IFX_EVADC_G_VFR_VF5_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF5 */
#define IFX_EVADC_G_VFR_VF5_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF5 */
#define IFX_EVADC_G_VFR_VF5_OFF (5u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF6 */
#define IFX_EVADC_G_VFR_VF6_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF6 */
#define IFX_EVADC_G_VFR_VF6_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF6 */
#define IFX_EVADC_G_VFR_VF6_OFF (6u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF7 */
#define IFX_EVADC_G_VFR_VF7_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF7 */
#define IFX_EVADC_G_VFR_VF7_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF7 */
#define IFX_EVADC_G_VFR_VF7_OFF (7u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF8 */
#define IFX_EVADC_G_VFR_VF8_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_VFR_Bits.VF8 */
#define IFX_EVADC_G_VFR_VF8_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_VFR_Bits.VF8 */
#define IFX_EVADC_G_VFR_VF8_OFF (8u)

/** \brief Length for Ifx_EVADC_G_VFR_Bits.VF9 */
#define IFX_EVADC_G_VFR_VF9_LEN (1u)

